#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jb-smoker/jetstream/runs/run-z9TiGN921a4VhCeK

Waiting for the plan to start...

Terraform v1.13.3
on linux_amd64
Initializing plugins and modules...
random_id.this: Refreshing state... [id=rfnj_w]
data.aws_ssm_parameter.ubuntu_ami: Refreshing...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-017458c60c6d9c78b]
module.litellm.data.aws_partition.current: Refreshing...
module.litellm.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_ssm_parameter.ubuntu_ami: Refresh complete after 0s [id=/aws/service/canonical/ubuntu/server/24.04/stable/current/amd64/hvm/ebs-gp3/ami-id]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0909b013eddbbfd66]
aws_key_pair.litellm: Refreshing state... [id=litellm-litellm-key-vpc-017458c60c6d9c78b-rfnj_w]
aws_security_group.litellm: Refreshing state... [id=sg-0f539b64e29eec6e7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0fe2f38948856480b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-038966bfd4d5f8566]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c4b23feb61d21e8a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-002adea9aa00b98cf]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c1d4851e0ad9d46a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0fe9e7f98bfd5f347]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cbbf97cd4b84efe7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04d24ba3a6df7e0d9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-055c4c9be4504ee12]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02f6d81ea9ae88e59]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0fe2f38948856480b1080289494]
aws_security_group_rule.litellm: Refreshing state... [id=sgrule-2660778902]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03f41404ff0c8a663]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a57b0cfcc1577f76]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06bce9fb043260d05]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06679ac58d81741e1]
module.litellm.data.aws_subnet.this[0]: Refreshing...
module.litellm.data.aws_subnet.this[0]: Refresh complete after 0s [id=subnet-04d24ba3a6df7e0d9]
module.litellm.aws_security_group.this[0]: Refreshing state... [id=sg-06f41e5204a4977b4]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01c65f171208aa863]
module.litellm.aws_vpc_security_group_egress_rule.this["ipv6_default"]: Refreshing state... [id=sgr-0e58e20b71df52391]
module.litellm.aws_vpc_security_group_egress_rule.this["ipv4_default"]: Refreshing state... [id=sgr-03c0c37861a07483d]
module.litellm.aws_instance.this[0]: Refreshing state... [id=i-0835542df7d48df0f]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cbbf97cd4b84efe71080289494]
aws_key_pair.litellm: Drift detected (update)
aws_security_group.litellm: Drift detected (update)
module.litellm.aws_security_group.this[0]: Drift detected (update)
module.vpc.aws_route_table.public[0]: Drift detected (update)
module.vpc.aws_default_route_table.default[0]: Drift detected (update)
module.vpc.aws_default_network_acl.this[0]: Drift detected (update)
module.vpc.aws_eip.nat[0]: Drift detected (update)
module.vpc.aws_route_table.private[0]: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "TF_VAR_openai_api_key"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-z9TiGN921a4VhCeK/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "TF_VAR_ssh_public_key"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-z9TiGN921a4VhCeK/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.litellm.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0835542df7d48df0f"
      ~ public_dns                           = "ec2-34-221-30-136.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "34.221.30.136" -> (known after apply)
        tags                                 = {
            "Name" = "litellm-instance"
        }
      ~ user_data                            = (sensitive value)
        # (39 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ litellm_public_ip = "http://34.221.30.136:3000" -> (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 1 of 8 estimated
           $8.377600000000000104/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

</details>
Pusher: @jb-smoker, Action: `pull_request